13/data/attachments/873d0b571cbb809a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bea1e51b-ccf9-435f-83f3-d38a4b0a24db</nif:username>
            <nif:friendToBeAdded>William_whatever_Friend_73051_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>